{
    "nav": {
        "home": "Home",
        "projects": "Projects",
        "skills": "Skills"
    },
    "sidebar": {
        "intro": "Intro",
        "about": "About Me"
    },
    "intro": {
        "greeting": "Hi, my name is",
        "name": "Suheda Sener",
        "paragraphs": [
            "I love creating things that make everyday life easier, especially when they start from a small idea and turn into a working solution.",
            "I'm curious, practical, and enjoy building something visible and useful digitally."
        ]
    },
    "langSwitch": {
        "en": "In English",
        "fi": "Suomeksi"
    },
    "about": {
        "title": "About Me",
        "description": "Hi, I'm Suheda, a curious developer and student who loves building things that start as simple thoughts and end up as useful digital tools that make life easier.",
        "story": "My interest in coding began when I switched from Metallurgical Engineering to IT and realized I could spend hours solving problems and building tools without noticing time pass. Since then, I’ve been on a journey to learn, build, and grow in the world of software development.",
        "experience": "I am currently studying Information Technology at Oulu University of Applied Sciences. During my studies, I took part in a cross-university Erasmus+ project in the Netherlands. Throughout my education, I have worked on several full-stack projects as part of coursework and personal interest.",
        "techIntro": "Technologies I've been working with recently include:",
        "techList": [
            "JavaScript (ES6+)",
            "TypeScript",
            "React",
            "Node.js",
            "Azure",
            "Express.js",
            "Docker",
            "Java"
        ]
    },
    "projects": {
        "featured": {
            "label": "Featured Project",
            "title": "Halcyon Theme",
            "description": "A minimal, dark blue theme for VS Code, Sublime Text, Atom, iTerm, and more. Available on Visual Studio Marketplace, Package Control, Atom Package Manager, and npm."
        },
        "featuredSection": "Featured Projects",
        "seeAll": "See All"
    }
}