{
    "nav": {
        "home": "Etusivu",
        "projects": "Projektit",
        "blogs": "Blogit"
    },
    "sidebar": {
        "intro": "Johdanto",
        "about": "Tietoa minusta",
        "experience": "Työkokemus",
        "projects": "Projektit",
        "skills": "Taidot"
    },
    "intro": {
        "greeting": "Tervetuloa!",
        "name": "Suheda Sener",
        "paragraphs": [
            "Rakastan tehdä asioita, jotka helpottavat arkea, erityisesti kun ne alkavat pienestä ideasta ja päätyvät toimivaksi ratkaisuksi. Olen utelias, käytännönläheinen ja nautin siitä, kun saan rakentaa jotain näkyvää ja hyödyllistä digitaalisesti."
        ],
        "cv": "Lataa CV:ni"
    },
    "langSwitch": {
        "en": "In English",
        "fi": "Suomeksi"
    },
    "about": {
        "title": "Tietoa minusta",
        "description": "Hei, olen Suheda, utelias kehittäjä ja opiskelija, joka rakastaa rakentaa asioita, jotka alkavat yksinkertaisista ajatuksista ja päätyvät hyödyllisiksi digitaalisiksi työkaluiksi, jotka helpottavat elämää.",
        "story": "Kiinnostukseni koodaamiseen alkoi, kun vaihdoin metallurgiainsinöörin opinnoista IT-alalle ja huomasin voivani viettää tunteja ongelmia ratkoen ja työkaluja rakentaen ilman, että aika tuntui kuluvan. Siitä lähtien olen kulkenut oppimisen, rakentamisen ja kasvun polkua ohjelmistokehityksen maailmassa.",
        "experience": "Opiskelen parhaillaan tietotekniikkaa Oulun ammattikorkeakoulussa. Opintojeni aikana osallistuin eri yliopistojen yhteiseen Erasmus+ -projektiin Alankomaissa. Koulutukseni aikana olen työskennellyt useissa full-stack-projekteissa osana opintojani ja omaa kiinnostustani.",
        "techIntro": "Teknologiat, joiden parissa olen viime aikoina työskennellyt, ovat:",
        "techList": [
            "JavaScript",
            "React",
            "React Native",
            "Node.js",
            "Python",
            "Express.js",
            "Docker",
            "Java"
        ]
    },
    "achievements": {
        "title": "Saavutukset",
        "items": [
            "Qtathon25 — Sijoitus Top 10 noin 200 tiimistä (toisen kierroksen tulos odotetaan)"
        ]
    },
    "experience": {
        "title": "Työkokemus",
        "role": "Fullstack-kehittäjä Harjoittelija",
        "company": "Zimba Oy",
        "period": "Lokakuu 2025 - Nykyhetki",
        "description": "Osallistun mobiilisovellusten full-stack-kehitykseen käyttäen React Nativea. Työskentelen nykyaikaisten teknologioiden ja kehysten parissa rakentaakseni skaalautuvia ratkaisuja osana kehitystiimiä.",
        "aboutCompany": "Tietoa Zimbasta",
        "companyDescription": "Zimba on suomalainen startup, joka kehittää innovatiivisia ohjelmistoratkaisuja ja digitaalisia alustoja."
    },
    "projects": {
        "sectionTitle": "Projektit",
        "seeAll": "Näytä kaikki",
        "projectList": [
            {
                "id": "matchnplay",
                "label": "Urheilun otteluiden sopimisalusta (Kehitteillä)",
                "title": "MatchNPlay",
                "description": "Oma projekti, jonka aloitin huomatessani tarpeen helpolle tavalle löytää pelejä ja pelikavereita. Työstän parhaillaan taustajärjestelmää, jossa on kirjautuminen, joukkueiden hallinta ja keskusteluominaisuudet.",
                "details": {
                    "overview": "MatchNPlay on käynnissä oleva projekti, jossa kehitän urheilun otteluiden sopimisalustaa. Sen avulla käyttäjät voivat järjestää pelejä, muodostaa joukkueita ja kommunikoida chatin ja palautteiden avulla. Taustajärjestelmä rakennetaan skaalautuvaksi ja sisältää kirjautumisen.",
                    "features": [
                        "Työn alla: OTP-pohjainen kirjautuminen",
                        "Pelin luominen ja joukkueiden hallinta",
                        "Keskustelu- ja palautetoiminnot",
                        "Tulevaisuudessa aikataulujen ja ilmoitusten integrointi"
                    ],
                    "techStack": [
                        "Java",
                        "Spring Boot",
                        "Spring Security",
                        "JWT",
                        "PostgreSQL",
                        "Redis",
                        "MailHog",
                        "Docker",
                        "Spring Data JPA",
                        "Swagger / API Documentation"
                    ],
                    "challenges": [
                        "Docker-ympäristön käyttöönotto taustajärjestelmälle ja tietokannalle",
                        "OTP-pohjaisen kirjautumisen ja sähköpostivahvistuksen toteuttaminen MailHogilla",
                        "Redis-välimuistin integrointi suorituskyvyn parantamiseksi",
                        "Skaalautuvan tietokantarakenteen suunnittelu käyttäjille, peleille, joukkueille ja chatille"
                    ],
                    "role": [
                        "Aloitin projektin itsenäisesti todetun tarpeen pohjalta",
                        "Suunnittelen taustajärjestelmän arkkitehtuurin ja tietomallin",
                        "Toteutan kirjautumisen, peli- ja joukkuelogiikan sekä viestintäominaisuudet"
                    ]
                },
                "links": [
                    {
                        "type": "github",
                        "url": "https://github.com/matchnplay"
                    }
                ],
                "image": "matchnplay"
            },
            {
                "id": "nordflix",
                "label": "Edistynyt verkkosovellus",
                "title": "NordFlix-elokuvasovellus",
                "description": "Full-stack-verkkosovellus elokuvien ja TV-ohjelmien selaamiseen, arvostelujen kirjoittamiseen, suosikkien tallentamiseen ja kiinnostuksen kohteisiin perustuvien ryhmien liittymiseen. Integroituu TMDb-API:n kanssa maailmanlaajuisten elokuva- ja TV-tietojen hakemiseksi sekä Finnkino-API:n kanssa Suomen elokuvateatterien aikataulujen näyttämiseksi.",
                "details": {
                    "overview": "NordFlix on full-stack-verkkosovellus elokuvien ja TV-ohjelmien selaamiseen, arvostelujen kirjoittamiseen, suosikkien tallentamiseen ja kiinnostuksen kohteisiin perustuvien ryhmien liittymiseen. Se integroituu TMDb-API:n kanssa maailmanlaajuisten elokuva- ja TV-tietojen hakemiseksi sekä Finnkino-API:n kanssa Suomen elokuvateatterien aikataulujen näyttämiseksi.",
                    "features": [
                        "Selaa elokuvia ja TV-ohjelmia yksityiskohtaisilla tiedoilla",
                        "Kirjoita ja lue arvosteluja",
                        "Tallenna suosikkeja nopeaa käyttöä varten",
                        "Liity kiinnostuksen kohteisiin perustuviin ryhmiin ja ole vuorovaikutuksessa niissä",
                        "Reaaliaikaiset näytösajat Suomessa Finnkino-API:sta"
                    ],
                    "techStack": [
                        "Figma",
                        "HTML",
                        "CSS",
                        "JavaScript",
                        "React",
                        "Express",
                        "Node.js",
                        "PostgreSQL",
                        "Mocha",
                        "Azure",
                        "Render",
                        "Postman"
                    ],
                    "challenges": [
                        "Reaaliaikainen dataintegraatio: Toteutettiin API-haku ja välimuisti suorituskyvyn optimoimiseksi.",
                        "Testaus: Automaattiset testit Mochalla luotettavuuden varmistamiseksi.",
                        "Skaalautuva isännöinti: Backend käyttöönotettu Azurella ja frontend Renderillä."
                    ],
                    "role": [
                        "Kehitin full-stack-ominaisuuksia (frontend-käyttöliittymä ja backend-rajapinnat)",
                        "Integroin TMDb- ja Finnkino-API:t",
                        "Kirjoitin automaattisia yksikkö- ja integrointitestejä Mochalla",
                        "Hallinnoin käyttöönottoa ja suorituskyvyn optimointia"
                    ]
                },
                "links": [
                    {
                        "type": "github",
                        "url": "https://github.com/suheda-snr/nordflix"
                    },
                    {
                        "type": "live",
                        "url": "https://green-bay-0f0301810.4.azurestaticapps.net/"
                    }
                ],
                "image": "nordflix"
            },
            {
                "id": "xit-project",
                "label": "Mobiilisovellusprojekti",
                "title": "X-it-projekti",
                "description": "Integroitu pakohuonejärjestelmä, jossa on tablettipohjainen check-in-sovellus ja sosiaalinen mobiilisovellus, toteutettu React Nativella, Nest.js:llä, PostgreSQL:llä ja Dockerilla.",
                "details": {
                    "overview": "X-it on kaksiosainen pakohuonealusta, kehitetty osana lyhytaikaista Erasmus+ -vaihto-opiskelijaprojektia yhteistyössä Alankomaista tulevien opiskelijoiden kanssa. Projekti sisälsi tablet-sovelluksen paikan päällä kirjautumiseen ja pulmien seurantaan (ryhmä 3 opiskelijaa) sekä backendin hallintajärjestelmän, joka tukee siihen liittyvää mobiilisosiaalista sovellusta (ryhmä 4 opiskelijaa). X-it-alusta tarjoaa kokonaisratkaisun pakohuoneiden hallintaan, mukaan lukien huoneiden hallinta, pelien aikataulutus ja varausten käsittely. Varmistaa sujuvan koordinoinnin paikan päällä tapahtuvien aktiviteettien ja mobiilikäyttäjien välillä. Alusta mahdollistaa pelaajien etenemisen seurannan, istuntotilastot ja reaaliaikaiset päivitykset sekä henkilökunnalle että pelaajille.",
                    "features": [
                        "Tablettisovellus check-iniin QR-lippujen skannausta varten",
                        "Reaaliaikainen pulmien ja vihjeiden tilan seuranta (simuloitu Firebasellä)",
                        "Automaattinen istuntojen seuranta ja tilastot (aika, käytetyt vihjeet, onnistuminen/epäonnistuminen)",
                        "Tulostaulut ja piilotettujen vihjeiden saavutukset",
                        "Mobiilisovellus tilastojen, tulostaulukoiden ja muiden pelaajien seuraamiseen",
                        "Yrityskäyttöinen hallinta: huoneiden aikataulutus, yritysprofiilit ja tilaukset"
                    ],
                    "techStack": [
                        "React Native",
                        "TypeScript",
                        "Nest.js",
                        "PostgreSQL",
                        "Prisma ORM",
                        "Docker",
                        "Zustand",
                        "Swagger",
                        "Firebase (laitteiston simulointiin)"
                    ],
                    "challenges": [
                        "Suurin haaste oli pakohuoneen laitteiston simulointi ilman fyysisiä laitteita. Ratkaistiin integroimalla Firebase simuloimaan pulmien tilasignaaleja ja vihjeiden laukaisuja reaaliajassa."
                    ],
                    "role": [
                        "Osallistuin osa-aikaisesti backend-kehittäjänä. Kehitin backend-ominaisuuksia pelien, pelaajien ja varausten hallintaan, varmistaen varauksien pätevyyden, pelaajien linkittämisen peleihin ja datan johdonmukaisuuden sovelluksessa.",
                        "Toteutin yrityskohtaisia ominaisuuksia, kuten rekisteröitymisen, huoneiden hallinnan ja aikataulutuksen",
                        "Työskentelin Firebase-integraation parissa laitteistojen simulointia varten tablet-sovelluksessa",
                        "Avustin Docker-konttien asetusten ja konfiguroinnin toteutuksessa"
                    ]
                },
                "links": [
                    {
                        "type": "github",
                        "url": "https://github.com/oamk-fontys/X-it-back-end"
                    },
                    {
                        "type": "github",
                        "url": "https://github.com/suheda-snr/X-itOS"
                    },
                    {
                        "type": "demo",
                        "url": "https://drive.google.com/file/d/1DXj9GvRWpvcBLgPs0MP7Yp7aC3ZYOx_u/view"
                    }
                ],
                "image": "xit"
            },
            {
                "id": "tastopia",
                "label": "Reseptien jakosovellus",
                "title": "Tastopia",
                "description": "Yhteisölähtöinen reseptialusta, jossa käyttäjät voivat jakaa, etsiä ja arvostella reseptejä intuitiivisella ja yhteisökeskeisellä käyttöliittymällä.",
                "details": {
                    "overview": "Tastopia on reseptienjakosovellus, joka kehitettiin ensimmäisenä verkkokehityskouluprojektinani 6 viikon aikana 4 hengen tiimissä. Sovellus yhdistää ruoan ystäviä reseptien jakamisen, etsimisen ja arvostelun kautta. Projekti sai arvosanan 5/5 ja sai palautetta siitä, että se oli edistyneempi kuin useimmat muut luokkatoverien projektit vankan ominaisuusvalikoimansa ja viimeistellyn käyttöliittymänsä ansiosta.",
                    "features": [
                        "Jaa omia reseptejä kuvauksilla ja kuvilla",
                        "Hallitse jaettuja reseptejä (näytä/poista)",
                        "Etsi reseptejä avainsanoilla tai kategorioilla",
                        "Arvostele ja kommentoi muiden käyttäjien reseptejä",
                        "Reseptiehdotuksia etusivulla",
                        "Käyttäjäautentikointi JWT:llä (rekisteröityminen/kirjautuminen)",
                        "Responsiivinen käyttöliittymä mobiili- ja työpöytäkäyttöön"
                    ],
                    "techStack": [
                        "Figma",
                        "HTML",
                        "CSS",
                        "Bootstrap",
                        "JavaScript",
                        "Node.js",
                        "Express",
                        "PostgreSQL",
                        "Sequelize",
                        "Scrum"
                    ],
                    "challenges": [
                        "JWT-pohjaisen autentikoinnin toteuttaminen: Integroitiin JWT Express-väliohjelmistoon tokenien validoimiseksi, varmistaen, että vain rekisteröityneet käyttäjät voivat jakaa, arvostella tai kommentoida reseptejä.",
                        "Responsiivisen käyttöliittymän kehittäminen: Käytettiin Bootstrapin ruudukkojärjestelmää ja mukautettuja CSS-mediatiedostoja luomaan saumaton kokemus mobiili- ja työpöytälaitteilla.",
                        "Tiimiyhteistyö: Otettiin käyttöön Scrum-menetelmä päivittäisillä standup-kokouksilla ja HackNPlan-tehtävienhallinnalla, mikä mahdollisti tehokkaan viestinnän ja tehtävien jaon 4 hengen tiimissä."
                    ],
                    "role": [
                        "Osallistuin tietokantaskeeman suunnitteluun PostgreSQL:llä ja Sequelize:llä",
                        "Toteutin backend-rajapintoja Expressillä ominaisuuksiin, kuten reseptihaku ja käyttäjäautentikointi",
                        "Rakensin keskeisiä frontend-sivuja, mukaan lukien etusivu, reseptitiedot ja hakutulokset, käyttäen HTML:ää, CSS:ää ja Bootstrapia"
                    ]
                },
                "links": [
                    {
                        "type": "github",
                        "url": "https://github.com/suheda-snr/tastopia"
                    }
                ],
                "image": "tastopia",
                "image2": "tastopia2"
            },
            {
                "id": "portfolio",
                "label": "Portfolio-sivusto",
                "title": "Henkilökohtainen Portfolio",
                "description": "Responsiivinen portfolio-sivusto, joka esittelee projektejani ja taitojani monikielituella ja animaatioilla.",
                "details": {
                    "overview": "Henkilökohtainen portfolio, joka esittelee projektejani, taitojani ja kokemustani.",
                    "features": [
                        "Responsiivinen suunnittelu",
                        "Monikielinen tuki (englanti/suomi)",
                        "Interaktiivinen käyttöliittymä animaatioilla"
                    ],
                    "techStack": [
                        "React",
                        "TypeScript",
                        "CSS",
                        "i18next",
                        "Netlify",
                        "Vite"
                    ],
                    "challenges": [
                        "Kielenvaihdon toteuttaminen i18next:llä",
                        "Responsiivisten asettelujen suunnittelu kaikille laitteille"
                    ],
                    "role": [
                        "Suunnittelin ja rakensin koko sivuston alusta alkaen"
                    ]
                },
                "links": [
                    {
                        "type": "github",
                        "url": "https://github.com/suheda-snr/portfolioSite"
                    },
                    {
                        "type": "live",
                        "url": "https://suhedasener.netlify.app/"
                    }
                ],
                "image": "portfolio"
            },
            {
                "id": "duunitori",
                "label": "Verkkokaavinta-automaatio",
                "title": "Duunitori-työpaikkakaavinta",
                "description": "Automaatiotyökalu, joka jäljittelee API:a kaapimalla työpaikkailmoituksia Duunitorin verkkosivustolta Puppeteerin avulla.",
                "details": {
                    "overview": "Automaatiotyökalu, joka jäljittelee API:a kaapimalla työpaikkailmoituksia Duunitorin verkkosivustolta Puppeteerin avulla.",
                    "features": [
                        "Pura työpaikan nimi, yritys ja tiedot HTML:stä",
                        "Vie tiedot JSON-muodossa",
                        "Automatisoidaan Windows Task Schedulerilla"
                    ],
                    "techStack": [
                        "Puppeteer",
                        "Node.js",
                        "JavaScript"
                    ],
                    "challenges": [
                        "Muuttuvan HTML-rakenteen käsittely: Käytettiin robusteja valitsimia ja varalogiikkaa.",
                        "Automatisoitu päivittäinen suoritus Windows Task Schedulerilla."
                    ],
                    "role": [
                        "Kirjoitin Puppeteer-kaavintaskriptejä",
                        "Toteutin tietojen jäsentämisen ja JSON-viennin",
                        "Määritin automaation"
                    ]
                },
                "links": [
                    {
                        "type": "github",
                        "url": "https://github.com/yourusername/duunitori-job-scraper"
                    },
                    {
                        "type": "demo",
                        "url": "https://drive.google.com/file/d/1LYbb-3Jpt9LsE4UHOdaEvD3aK5lQHO3b/view"
                    }
                ],
                "image": "duunitori"
            },
            {
                "id": "helios-sms",
                "label": "Helios - Puvun valvontajärjestelmä (Helios SMS)",
                "title": "Helios SMS",
                "description": "Avaruuspuvun telemetrian valvonta- ja tehtävienhallintasovellus, rakennettu Pythonilla ja PySide6/Qt:lla. Sisältää simulaattorin ja MQTT-integraation.",
                "details": {
                    "overview": "Helios SMS on edistynyt avaruuspukujen telemetrian valvonta- ja tehtävienhallintajärjestelmä. Se tarjoaa reaaliaikaisen elintoimintojen seurannan, tehtävien hallinnan, turvallisuusvaroitukset ja puvun simulaattorin testausta varten. Qtathon25: sijoitus Top 10 noin 200 tiimistä (toisen kierroksen tulos odotetaan).",
                    "features": [
                        "Reaaliaikainen telemetria ja elintoimintojen seuranta",
                        "Tehtäväsuunnittelu ja seuranta",
                        "Monitasoiset turvallisuusvaroitukset äänellä",
                        "Sisäänrakennettu puvun simulaattori testaukseen",
                        "MQTT-pohjainen viestintä telemetrylle ja komennoille"
                    ],
                    "techStack": [
                        "Python",
                        "PySide6 / Qt",
                        "QML",
                        "paho-mqtt",
                        "MQTT",
                        "JSON-tallennus"
                    ],
                    "challenges": [
                        "Realistisen telemetriasimulaation suunnittelu testausta varten",
                        "Luotettavan MQTT-viestinnän ja topiikkien hallinnan varmistaminen",
                        "Intuitiivisen kojelaudan suunnittelu kriittisille arvoille"
                    ],
                    "role": [
                        "Toteutin telemetrian käsittelyn, simulaattorin ja MQTT-integraation",
                        "Rakensin tehtävienhallinnan ja varoitusjärjestelmän",
                        "Suunnittelin QML/Qt-käyttöliittymäkomponentit ja visualisoinnit"
                    ]
                },
                "links": [
                    {
                        "type": "github",
                        "url": "https://github.com/suheda-snr/helios_sms"
                    }
                ],
                "image": "helios",
                "image2": "helios2"
            },
            {
                "id": "twilio-motivation",
                "label": "Automaatiotyökalu",
                "title": "Automatisoitu motivaatiojärjestelmä",
                "description": "Node.js-pohjainen automaatiotyökalu, joka lähettää päivittäisiä motivoivia viestejä SMS:n kautta Twilio API:n avulla.",
                "details": {
                    "overview": "Node.js-pohjainen automaatiotyökalu, joka lähettää päivittäisiä motivoivia viestejä SMS:n kautta Twilio API:n avulla.",
                    "features": [
                        "Ajastettu SMS-lähetys",
                        "Satunnaistetut päivittäiset lainaukset",
                        "Muokattava vastaanottajalista"
                    ],
                    "techStack": [
                        "Node.js",
                        "Twilio API",
                        "JavaScript",
                        "Cron-työt"
                    ],
                    "challenges": [
                        "Ajastuksen toteuttaminen Node-cronilla",
                        "Twilio API:n nopeusrajoitusten käsittely"
                    ],
                    "role": [
                        "Integroin Twilio API:n",
                        "Rakensin ajastus- ja viestin satunnaistamislogiikan"
                    ]
                },
                "links": [
                    {
                        "type": "github",
                        "url": "https://github.com/yourusername/twilio-motivation"
                    }
                ],
                "image": "twilio"
            }
        ],
        "projectDetailsTitles": {
            "overview": "Yleiskatsaus",
            "features": "Pääominaisuudet",
            "techStack": "Teknologia",
            "challenges": "Haasteet ja Ratkaisut",
            "role": "Roolini",
            "links": "Linkit"
        }
    },
    "skills": {
        "languagesFrameworksTitle": "Kielet & Kehykset",
        "languagesFrameworks": [
            {
                "name": "JavaScript",
                "level": "90%"
            },
            {
                "name": "TypeScript",
                "level": "80%"
            },
            {
                "name": "React",
                "level": "85%"
            },
            {
                "name": "React Native",
                "level": "80%"
            },
            {
                "name": "Next.js",
                "level": "75%"
            },
            {
                "name": "Node.js",
                "level": "85%"
            },
            {
                "name": "Express.js",
                "level": "85%"
            },
            {
                "name": "Java",
                "level": "80%"
            },
            {
                "name": "Python",
                "level": "75%"
            },
            {
                "name": "HTML/CSS",
                "level": "85%"
            },
            {
                "name": "SQL",
                "level": "80%"
            }
        ],
        "toolsPlatformsTitle": "Työkalut & Alustat",
        "toolsPlatforms": [
            "PostgreSQL",
            "MySQL",
            "Docker",
            "Azure",
            "Render",
            "Cloudflare",
            "GitHub",
            "Figma",
            "Postman",
            "Puppeteer",
            "Linux"
        ],
        "practicesTitle": "Kehityskäytännöt",
        "practices": [
            "API Design",
            "Database Design",
            "API Testing & Integration",
            "Automated Testing",
            "Agile",
            "Scrum"
        ]
    }
}
